#include <stdio.h>
void func(long unsigned n){
    int a[65536]; 
    // printf("使ってるメモリ合計：　%lu b %p\n", n * sizeof(int) * 65536, a);
    printf("使ってるメモリ合計：　%lu b %p\n", n + sizeof(a), a);
    func(n + sizeof(a));
}
int main(){
    func(0);
    return 0;
}

// p234071@jns15:~/Documents/Source Codes/C Language/c-0926$ ./a.out
// 使ってるメモリ合計：　262144 b 0x7ffc5d973060
// 使ってるメモリ合計：　524288 b 0x7ffc5d933030
// 使ってるメモリ合計：　786432 b 0x7ffc5d8f3000
// 使ってるメモリ合計：　1048576 b 0x7ffc5d8b2fd0
// 使ってるメモリ合計：　1310720 b 0x7ffc5d872fa0
// 使ってるメモリ合計：　1572864 b 0x7ffc5d832f70
// 使ってるメモリ合計：　1835008 b 0x7ffc5d7f2f40
// 使ってるメモリ合計：　2097152 b 0x7ffc5d7b2f10
// 使ってるメモリ合計：　2359296 b 0x7ffc5d772ee0
// 使ってるメモリ合計：　2621440 b 0x7ffc5d732eb0
// 使ってるメモリ合計：　2883584 b 0x7ffc5d6f2e80
// 使ってるメモリ合計：　3145728 b 0x7ffc5d6b2e50
// 使ってるメモリ合計：　3407872 b 0x7ffc5d672e20
// 使ってるメモリ合計：　3670016 b 0x7ffc5d632df0
// 使ってるメモリ合計：　3932160 b 0x7ffc5d5f2dc0
// 使ってるメモリ合計：　4194304 b 0x7ffc5d5b2d90
// 使ってるメモリ合計：　4456448 b 0x7ffc5d572d60
// 使ってるメモリ合計：　4718592 b 0x7ffc5d532d30
// 使ってるメモリ合計：　4980736 b 0x7ffc5d4f2d00
// 使ってるメモリ合計：　5242880 b 0x7ffc5d4b2cd0
// 使ってるメモリ合計：　5505024 b 0x7ffc5d472ca0
// 使ってるメモリ合計：　5767168 b 0x7ffc5d432c70
// 使ってるメモリ合計：　6029312 b 0x7ffc5d3f2c40
// 使ってるメモリ合計：　6291456 b 0x7ffc5d3b2c10
// 使ってるメモリ合計：　6553600 b 0x7ffc5d372be0
// 使ってるメモリ合計：　6815744 b 0x7ffc5d332bb0
// 使ってるメモリ合計：　7077888 b 0x7ffc5d2f2b80
// 使ってるメモリ合計：　7340032 b 0x7ffc5d2b2b50
// 使ってるメモリ合計：　7602176 b 0x7ffc5d272b20
// 使ってるメモリ合計：　7864320 b 0x7ffc5d232af0
// 使ってるメモリ合計：　8126464 b 0x7ffc5d1f2ac0
// Segmentation fault (コアダンプ)

//合計8126464Bぐらいを使っている
//8126464B / 1024 = 7936KB
//7936KB / 1024 = 7.75MB